"""
元祖
与列表大致相同
区别：不可以改变长度的容器，以 () 表示
"""

if __name__ == '__main__':
    # 创建元祖的语法 1
    tuple_0 = tuple()

    # 创建元祖的语法 2
    tuple_1 = (1, 2, 3, 4, 5)
    # 下标     0  1  2  3  4
    print("元祖: ", tuple_1)  # 输出 (1, 2, 3, 4, 5)

    # 获取元祖元素个数
    print("获取元祖元素个数: ", len(tuple_1))  # 输出 5

    # 读取元素指定下标的值
    print("读取元素指定下标的值 tuple_1[0]:", tuple_1[0])  # 输出 1
    print("读取元素指定下标的值 tuple_1[3]:", tuple_1[3])  # 输出 4

    # 截取其中元素
    print("截取其中元素 tuple_1[1:3]: ", tuple_1[1:3])  # 输出 [2,3], 从下标1起, 截取到下标3，不包括下标3

